wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
/*
 * Waiting on SDIO->STA without leaving a gap between served cycles.
 *
 * The STA read is on APB2 and costs ~60-120 ns. Done straight after a yield it
 * lands inside the freshly started Atari cycle and delays the data-bus write.
 * Card init spends >100k cycles in these waits, so those small overruns add up
 * to a near-certain jam. Sample STA in the free (A12-low) window instead and
 * let the wait loop test only a cached copy — one SRAM load between serves.
 */
static volatile uint32_t sd_sta_cached;

/*
 * Block length currently programmed into the card, so CMD16 (SET_BLOCKLEN) can be
 * skipped on a read when it would change nothing. It is 512 for every transfer
 * this firmware performs, and playback issues hundreds of reads a second, so the
 * stock driver's unconditional CMD16-plus-response-wait per sector was pure
 * repeated cost. 0 means unknown; reset it in SD_Init, and update it anywhere that
 * sends CMD16 with a different length, or a stale 512 would silently corrupt a read.
 *
 * NB: this is deliberately introduced *alone*, without the DPSM-window yields that
 * accompanied it last time and regressed reads.
 */
static uint16_t sd_cur_blocklen;

static void
sd_sample_sta(void)
{
	sd_sta_cached = SDIO->STA;
}

/* Serve until STA shows `mask`, bounded by `iters` served cycles. */
static uint32_t
sd_wait_sta(uint32_t mask, uint32_t iters)
{
	sd_sta_cached = SDIO->STA;

	while (!(sd_sta_cached & mask) && iters--)
		moviecart_bus_pump(sd_sample_sta);

	return sd_sta_cached;
}

/* Same, waiting for every bit of `mask` to go away (RXACT/TXACT draining). */
static uint32_t
sd_wait_sta_clear(uint32_t mask, uint32_t iters)
{
	sd_sta_cached = SDIO->STA;

	while ((sd_sta_cached & mask) && iters--)
		moviecart_bus_pump(sd_sample_sta);

	return sd_sta_cached;
}

/*
 * Response waits in the stock driver were unbounded. Keep them effectively so,
 * but with a ceiling: each iteration is about one Atari cycle, so this is tens
 * of milliseconds — far beyond any real card, yet it cannot wedge forever.
 */
#define SD_STA_WAIT_MAX		60000u

/*
 * Per-pin GPIO setup for the SDIO lines, one pin per served cycle.
 *
 * The TM_GPIO_* helpers each loop over all 16 pin positions doing register
 * read-modify-writes, which is comfortably more than the ~838 ns an Atari cycle
 * allows — a single yield placed *between* those calls still left whole missed
 * cycles inside them. Writing the five registers for one pin is ~250 ns, so
 * doing it a pin at a time with a serve after each keeps every gap sub-cycle.
 */
static void
sd_pin_af(GPIO_TypeDef *port, uint32_t pin, uint32_t pupd)
{
	uint32_t p2 = pin * 2u;
	uint32_t as = (pin & 7u) * 4u;

	port->AFR[pin >> 3u] = (port->AFR[pin >> 3u] & ~(0xFu << as)) |
			       ((uint32_t)GPIO_AF_SDIO << as);
	port->PUPDR = (port->PUPDR & ~(3u << p2)) | (pupd << p2);
	port->OSPEEDR = (port->OSPEEDR & ~(3u << p2)) | (2u << p2);	/* Fast */
	port->OTYPER &= ~(1u << pin);					/* push-pull */
	port->MODER = (port->MODER & ~(3u << p2)) | (2u << p2);		/* AF */

	moviecart_bus_yield();
}

/* Release one pin: analog mode with a pull-down, matching the previous DeInit. */
static void
sd_pin_release(GPIO_TypeDef *port, uint32_t pin)
{
	uint32_t p2 = pin * 2u;

	port->MODER |= (3u << p2);
	port->PUPDR = (port->PUPDR & ~(3u << p2)) | (2u << p2);

	moviecart_bus_yield();
}

/*
 * SCR drain step, run only in free cycles by moviecart_bus_pump. The SCR is two
 * words, so the destination is bounded explicitly rather than trusting RXDAVL.
 */
static uint32_t *scr_dest;
static volatile uint32_t scr_index;

static void
scr_drain(void)
{
	sd_sta_cached = SDIO->STA;
	if ((SDIO->STA & SDIO_FLAG_RXDAVL) && scr_index < 2u)
		scr_dest[scr_index++] = SDIO_ReadData ();
}

/*
 * IRQs stay masked for the Atari bus; pump SDIO/DMA completion by hand.
 *
 * One of the two checks per free cycle, never both. Even a free A12-low cycle is
 * only ~838 ns and we enter it partway through, while the SDIO branch alone is up
 * to four APB2 accesses on the DATAEND path (status read, pending-bit clear, MASK
 * read-modify-write) — adding the DMA register check on top can overrun the
 * window, and one overrun means one missed fetch, which the coarse sweep showed is
 * enough to garble the picture. Alternating halves the worst-case step and costs
 * only one extra free cycle per poll.
 */
static uint8_t sd_pump_phase;

static void
sd_pump_completion(void)
{
	sd_pump_phase ^= 1u;

	if (sd_pump_phase) {
		if (SDIO->STA & (SDIO_IT_DATAEND | SDIO_IT_DCRCFAIL |
				 SDIO_IT_DTIMEOUT | SDIO_IT_RXOVERR |
				 SDIO_IT_TXUNDERR | SDIO_IT_STBITERR))
			SD_ProcessIRQSrc();
	} else {
		SD_ProcessDMAIRQ();
	}
}


static uint32_t CardType = SDIO_STD_CAPACITY_SD_CARD_V1_1;
static uint32_t CSD_Tab[4], CID_Tab[4], RCA = 0;
static uint8_t SDSTATUS_Tab[16];
__IO uint32_t StopCondition = 0;
__IO SD_Error TransferError = SD_OK;
__IO uint32_t TransferEnd = 0, DMAEndOfTransfer = 0;
SD_CardInfo SDCardInfo;

SDIO_InitTypeDef SDIO_InitStructure;
SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
SDIO_DataInitTypeDef SDIO_DataInitStructure;
/**
 * @}
 */

/** @defgroup STM324x9I_EVAL_SDIO_SD_Private_Function_Prototypes
 * @{
 */
static SD_Error CmdError (void);
static SD_Error CmdResp1Error (uint8_t cmd);
static SD_Error CmdResp7Error (void);
static SD_Error CmdResp3Error (void);
static SD_Error CmdResp2Error (void);
static SD_Error CmdResp6Error (uint8_t cmd, uint16_t *prca);
static SD_Error SDEnWideBus (FunctionalState NewState);
static SD_Error IsCardProgramming (uint8_t *pstatus);
static SD_Error FindSCR (uint16_t rca, uint32_t *pscr);
uint8_t convert_from_bytes_to_power_of_two (uint16_t NumberOfBytes);

static volatile DSTATUS TM_FATFS_SD_SDIO_Stat = STA_NOINIT;	/* Physical drive status */

#define BLOCK_SIZE            512

uint8_t TM_FATFS_SDIO_WriteEnabled(void) {
#if FATFS_USE_WRITEPROTECT_PIN > 0
	return !TM_GPIO_GetInputPinValue(FATFS_USE_WRITEPROTECT_PIN_PORT, FATFS_USE_WRITEPROTECT_PIN_PIN);
#else
	return 1;
#endif
}

DSTATUS TM_FATFS_SD_SDIO_disk_initialize(void) {
	NVIC_InitTypeDef NVIC_InitStructure;
	
	/* Detect pin */
#if FATFS_USE_DETECT_PIN > 0
	TM_GPIO_Init(FATFS_USE_DETECT_PIN_PORT, FATFS_USE_DETECT_PIN_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Low);
#endif

	/* Write protect pin */
#if FATFS_USE_WRITEPROTECT_PIN > 0
	TM_GPIO_Init(FATFS_USE_WRITEPROTECT_PIN_PORT, FATFS_USE_WRITEPROTECT_PIN_PIN, TM_GPIO_Mode_IN, TM_GPIO_OType_PP, TM_GPIO_PuPd_UP, TM_GPIO_Speed_Low);
#endif
	
	/* Do not touch NVIC_PriorityGroupConfig here — main owns Group_4.
	 * SDIO/DMA below cart EXTI (0) and TIM1 bus (1). */
	NVIC_InitStructure.NVIC_IRQChannel = SDIO_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init (&NVIC_InitStructure);
	NVIC_InitStructure.NVIC_IRQChannel = SD_SDIO_DMA_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_Init (&NVIC_InitStructure);

	MC_PROBE(MC_PHASE_SDIO_REGS);	/* entry + NVIC */
	moviecart_bus_yield();

	MC_PROBE(MC_PHASE_PINS);	/* pin release */
	SD_LowLevel_DeInit();
	MC_PROBE(MC_PHASE_PINS);	/* pin setup */
	SD_LowLevel_Init();

	/* Card power / CMD0 can fail intermittently on DevEBox — retry a few times. */
	{
		int attempt;
		SD_Error err = SD_ERROR;
		for (attempt = 0; attempt < 5; attempt++) {
			if (attempt)
				moviecart_delay_ms(50);
			err = SD_Init();
			if (err == SD_OK)
				break;
			SD_LowLevel_DeInit();
			SD_LowLevel_Init();
		}
		if (err == SD_OK) {
			TM_FATFS_SD_SDIO_Stat &= ~STA_NOINIT;	/* Clear STA_NOINIT flag */
		} else {
			TM_FATFS_SD_SDIO_Stat |= STA_NOINIT;
		}
	}
	//Check write protected
	if (!TM_FATFS_SDIO_WriteEnabled()) {
		TM_FATFS_SD_SDIO_Stat |= STA_PROTECT;
	} else {
		TM_FATFS_SD_SDIO_Stat &= ~STA_PROTECT;
	}
	
	return TM_FATFS_SD_SDIO_Stat;
}

DSTATUS TM_FATFS_SD_SDIO_disk_status(void) {
	if (SD_Detect() != SD_PRESENT) {
		return STA_NOINIT;
	}
	
	if (!TM_FATFS_SDIO_WriteEnabled()) {
		TM_FATFS_SD_SDIO_Stat |= STA_PROTECT;
	} else {
		TM_FATFS_SD_SDIO_Stat &= ~STA_PROTECT;
	}
	
	return TM_FATFS_SD_SDIO_Stat;
}

DRESULT TM_FATFS_SD_SDIO_disk_read(BYTE *buff, DWORD sector, UINT count) {
	SD_Error Status = SD_OK;

	if ((TM_FATFS_SD_SDIO_Stat & STA_NOINIT)) {
		return RES_NOTRDY;
	}
	
	if ((DWORD)buff & 3) {
		DRESULT res = RES_OK;
		DWORD scratch[BLOCK_SIZE / 4];

