wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
#define SD_POLL_ERR_FLAGS	(SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | \
				 SDIO_FLAG_RXOVERR | SDIO_FLAG_STBITERR)

static void
sd_poll_drain(void)
{
	uint32_t sta = SDIO->STA;

	if (sta & SD_POLL_ERR_FLAGS) {
		sd_poll_err = sta;
		return;
	}

	if ((sta & SDIO_FLAG_RXDAVL) && sd_poll_words) {
		*sd_poll_dst++ = SDIO_ReadData();
		sd_poll_words--;
	}
}

SD_Error
SD_ReadBlock_Polled(uint8_t *readbuff, uint64_t ReadAddr, uint16_t BlockSize)
{
	SD_Error errorstatus = SD_OK;
	uint32_t guard;

	TransferError = SD_OK;
	TransferEnd = 0;
	StopCondition = 0;

	SDIO->DCTRL = 0x0;

	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD) {
		BlockSize = 512;
		ReadAddr /= 512;
	}

	/* Set block length only when it would change (see SD_ReadBlock). */
	if (sd_cur_blocklen != BlockSize) {
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand (&SDIO_CmdInitStructure);

		errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN);
		if (SD_OK != errorstatus)
			return errorstatus;

		sd_cur_blocklen = BlockSize;
	}

	/* Arm the receive path (no DMA). */
	sd_poll_dst = (uint32_t *) readbuff;
	sd_poll_words = BlockSize / 4u;
	sd_poll_err = 0;

	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) SDIO_DATABLOCKSIZE;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfig (&SDIO_DataInitStructure);

	/*!< Send CMD17 READ_SINGLE_BLOCK */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) ReadAddr;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_READ_SINGLE_BLOCK;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand (&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error (SD_CMD_READ_SINGLE_BLOCK);
	if (errorstatus != SD_OK)
		return errorstatus;

	/*
	 * Drain in the free cycles. The guard is a loose escape hatch for a dead
	 * bus (no free cycles ever) or a stalled card; a live transfer completes in
	 * far fewer iterations. It is a register decrement, so it costs the serve
	 * loop nothing.
	 */
	guard = 8u * 1000u * 1000u;
	while (sd_poll_words && !sd_poll_err && --guard)
		moviecart_bus_pump(sd_poll_drain);

	if (sd_poll_err) {
		SDIO->ICR = SDIO_STATIC_FLAGS;
		if (sd_poll_err & SDIO_FLAG_DCRCFAIL)
			return SD_DATA_CRC_FAIL;
		if (sd_poll_err & SDIO_FLAG_DTIMEOUT)
			return SD_DATA_TIMEOUT;
		if (sd_poll_err & SDIO_FLAG_RXOVERR)
			return SD_RX_OVERRUN;
		return SD_START_BIT_ERR;
	}

	if (sd_poll_words) {		/* guard expired before the sector finished */
		SDIO->ICR = SDIO_STATIC_FLAGS;
		return SD_DATA_TIMEOUT;
	}

	SDIO->ICR = SDIO_STATIC_FLAGS;
	return SD_OK;
}
#endif /* MOVIECART_SD_POLL_READ */

/**
 * @brief  Allows to read one block from a specified address in a card. The Data
 *         transfer can be managed by DMA mode or Polling mode.
 * @note   This operation should be followed by two functions to check if the
 *         DMA Controller and SD Card status.
 *          - SD_ReadWaitOperation(): this function insure that the DMA
 *            controller has finished all data transfer.
 *          - SD_GetStatus(): to check that the SD Card has finished the
 *            data transfer and it is ready for data.
 * @param  readbuff: pointer to the buffer that will contain the received data
 * @param  ReadAddr: Address from where data are to be read.
 * @param  BlockSize: the SD card Data block size. The Block size should be 512.
 * @retval SD_Error: SD Card Error code.
 */
SD_Error SD_ReadBlock (uint8_t *readbuff, uint64_t ReadAddr, uint16_t BlockSize)
{
	SD_Error errorstatus = SD_OK;
#if defined (SD_POLLING_MODE) 
	uint32_t count = 0, *tempbuff = (uint32_t *)readbuff;
#endif

	TransferError = SD_OK;
	TransferEnd = 0;
	StopCondition = 0;

	SDIO ->DCTRL = 0x0;

#if defined (SD_DMA_MODE)
	SDIO->MASK |= (SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR);
	SDIO_DMACmd (ENABLE);
	SD_LowLevel_DMA_RxConfig ((uint32_t *) readbuff, BlockSize);
#endif

	if (CardType == SDIO_HIGH_CAPACITY_SD_CARD ) {
		BlockSize = 512;
		ReadAddr /= 512;
	}

	/* Set Block Size for Card — only when it would actually change. */
	if (sd_cur_blocklen != BlockSize) {
		SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) BlockSize;
		SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SET_BLOCKLEN;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand (&SDIO_CmdInitStructure);

		errorstatus = CmdResp1Error (SD_CMD_SET_BLOCKLEN );

		if (SD_OK != errorstatus) {
			return (errorstatus);
		}

		sd_cur_blocklen = BlockSize;
	}

	SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
	SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
	SDIO_DataInitStructure.SDIO_DataBlockSize = (uint32_t) SDIO_DATABLOCKSIZE;
	SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
	SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
	SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
	SDIO_DataConfig (&SDIO_DataInitStructure);

	/*!< Send CMD17 READ_SINGLE_BLOCK */
	SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) ReadAddr;
	SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_READ_SINGLE_BLOCK;
	SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
	SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
	SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
	SDIO_SendCommand (&SDIO_CmdInitStructure);

	errorstatus = CmdResp1Error (SD_CMD_READ_SINGLE_BLOCK );

