wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
		if (SDIO_GetFlagStatus (SDIO_FLAG_DTIMEOUT) != RESET) {
			SDIO->ICR =  (SDIO_FLAG_DTIMEOUT);
			errorstatus = SD_DATA_TIMEOUT;
			return (errorstatus);
		} else if (SDIO_GetFlagStatus (SDIO_FLAG_DCRCFAIL) != RESET) {
			SDIO->ICR =  (SDIO_FLAG_DCRCFAIL);
			errorstatus = SD_DATA_CRC_FAIL;
			return (errorstatus);
		} else if (SDIO_GetFlagStatus (SDIO_FLAG_RXOVERR) != RESET) {
			SDIO->ICR =  (SDIO_FLAG_RXOVERR);
			errorstatus = SD_RX_OVERRUN;
			return (errorstatus);
		} else if (SDIO_GetFlagStatus (SDIO_FLAG_STBITERR) != RESET) {
			SDIO->ICR =  (SDIO_FLAG_STBITERR);
			errorstatus = SD_START_BIT_ERR;
			return (errorstatus);
		}
		count = SD_DATATIMEOUT;
		while ((SDIO_GetFlagStatus (SDIO_FLAG_RXDAVL) != RESET) && (count > 0)) {
			*tempbuff = SDIO_ReadData ();
			tempbuff++;
			count--;
		}

		/*!< Clear all the static flags */
		SDIO->ICR =  (SDIO_STATIC_FLAGS );

		/* Test if the switch mode HS is ok */
		if ((hs[13] & 0x2) == 0x2) {
			errorstatus = SD_OK;
		} else {
			errorstatus = SD_UNSUPPORTED_FEATURE;
		}
	}
	return (errorstatus);
}

/**
 ******************************************************************************
 * @author  MCD Application Team (modified by lukasz.iwaszkiewicz@gmail.com)
 * @version V1.0.3
 * @date    13-November-2013
 * @brief   This file provides
 *            - set of firmware functions to manage Leds, push-button and COM ports
 *            - low level initialization functions for SD card (on SDIO) and EEPROM
 *          available on STM324x9I-EVAL evaluation board(MB1045) RevB from
 *          STMicroelectronics.
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
 *
 * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at:
 *
 *        http://www.st.com/software_license_agreement_liberty_v2
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************
 */

/**
 * @brief  DeInitializes the SDIO interface.
 * @param  None
 * @retval None
 */
void SD_LowLevel_DeInit(void) {
	/* One-shot register/GPIO sequence; yield between groups so the run does
	 * not exceed a single Atari cycle and drop a fetch. */
	/*!< Disable SDIO Clock */
	SDIO_ClockCmd(DISABLE);

	/*!< Set Power State to OFF */
	SDIO_SetPowerState(SDIO_PowerState_OFF);

	moviecart_bus_yield();

	/*!< DeInitializes the SDIO peripheral */
	SDIO_DeInit();

	/* Disable the SDIO APB2 Clock */
	RCC->APB2ENR &= ~RCC_APB2ENR_SDIOEN;

	moviecart_bus_yield();

	sd_pin_release(GPIOC, 8u);
#if FATFS_SDIO_4BIT == 1
	sd_pin_release(GPIOC, 9u);
	sd_pin_release(GPIOC, 10u);
	sd_pin_release(GPIOC, 11u);
#endif
	sd_pin_release(GPIOC, 12u);
	sd_pin_release(GPIOD, 2u);
}

/**
 * @brief  Initializes the SD Card and put it into StandBy State (Ready for
 *         data transfer).
 * @param  None
 * @retval None
 */
void SD_LowLevel_Init (void) {
	/* GPIOC/GPIOD clocks (GPIOD already on for the Atari data bus). */
	RCC->AHB1ENR |= RCC_AHB1ENR_GPIOCEN | RCC_AHB1ENR_GPIODEN;

	moviecart_bus_yield();

	/* D0 (and D1-D3 in 4-bit): pull-ups. CK (PC12): no pull. CMD (PD2): pull-up. */
	sd_pin_af(GPIOC, 8u, 1u);
#if FATFS_SDIO_4BIT == 1
	sd_pin_af(GPIOC, 9u, 1u);
	sd_pin_af(GPIOC, 10u, 1u);
	sd_pin_af(GPIOC, 11u, 1u);
#endif
	sd_pin_af(GPIOC, 12u, 0u);
	sd_pin_af(GPIOD, 2u, 1u);

	/* Enable the SDIO APB2 Clock */
	RCC->APB2ENR |= RCC_APB2ENR_SDIOEN;

	/* Enable the DMA2 Clock */
	RCC->AHB1ENR |= SD_SDIO_DMA_CLK;

	moviecart_bus_yield();
}

/**
 * @brief  Configures the DMA2 Channel4 for SDIO Tx request.
 * @param  BufferSRC: pointer to the source buffer
 * @param  BufferSize: buffer size
 * @retval None
 */
void SD_LowLevel_DMA_TxConfig (uint32_t *BufferSRC, uint32_t BufferSize) {
	DMA_InitTypeDef SDDMA_InitStructure;

	DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF | SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF | SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);

	/* DMA2 Stream3  or Stream6 disable */
	DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);

	/* DMA2 Stream3  or Stream6 Config */
	DMA_DeInit(SD_SDIO_DMA_STREAM );

	SDDMA_InitStructure.DMA_Channel = SD_SDIO_DMA_CHANNEL;
	SDDMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) SDIO_FIFO_ADDRESS;
	SDDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) BufferSRC;
	SDDMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;
	SDDMA_InitStructure.DMA_BufferSize = 1;
	SDDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	SDDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	SDDMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
	SDDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte; /* DMA_MemoryDataSize_Word; */
	SDDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	SDDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	SDDMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
	SDDMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_HalfFull;
	SDDMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;
	SDDMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_INC4;
	DMA_Init (SD_SDIO_DMA_STREAM, &SDDMA_InitStructure);
	DMA_ITConfig (SD_SDIO_DMA_STREAM, DMA_IT_TC, ENABLE);
	DMA_FlowControllerConfig (SD_SDIO_DMA_STREAM, DMA_FlowCtrl_Peripheral);

	/* DMA2 Stream3  or Stream6 enable */
	DMA_Cmd(SD_SDIO_DMA_STREAM, ENABLE);
}
/**
 * @brief  Configures the DMA2 Channel4 for SDIO Rx request.
 * @param  BufferDST: pointer to the destination buffer
 * @param  BufferSize: buffer size
 * @retval None
 */
/*
 * Per-sector DMA setup must be tiny.
 *
 * The stock sequence is DMA_ClearFlag, DMA_Cmd(DISABLE), DMA_DeInit, DMA_Init,
 * DMA_ITConfig, DMA_FlowControllerConfig, DMA_Cmd(ENABLE) — dozens of register
 * accesses plus DMA_DeInit's spin waiting for EN to clear, and it ran on *every*
 * sector with yields only *between* the calls, never inside them. Each call is
 * therefore microseconds of straight-line work with the Atari unserved, and the
 * coarse sweep says a single missed cart fetch is enough to garble the picture.
 * That is the per-sector risk the failure gradient was measuring.
 *
 * Nothing about the stream's configuration changes from sector to sector except
 * the destination address, so do the full init once and afterwards touch only
 * what must change, with a yield between individual register writes. Everything
 * else — channel, direction, burst, FIFO, TC interrupt, peripheral flow control —
 * survives a disable/enable untouched.
 */
static uint8_t sd_dma_rx_ready;

void SD_LowLevel_DMA_RxConfig (uint32_t *BufferDST, uint32_t BufferSize)
{
	DMA_InitTypeDef SDDMA_InitStructure;

	if (sd_dma_rx_ready) {
		DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);
		moviecart_bus_yield();

