wjblanke/moviecart/firmware/stm32/Libraries/tm_stm32f4_fatfs/fatfs/drivers/fatfs_sd_sdio.c
		/* Serve the bus while the stream winds down, rather than spinning. */
		while (SD_SDIO_DMA_STREAM->CR & (uint32_t)DMA_SxCR_EN)
			moviecart_bus_yield();

		DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF |
			      SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF |
			      SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);
		moviecart_bus_yield();

		SD_SDIO_DMA_STREAM->M0AR = (uint32_t)BufferDST;
		moviecart_bus_yield();

		DMA_Cmd(SD_SDIO_DMA_STREAM, ENABLE);
		return;
	}

	DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_FEIF | SD_SDIO_DMA_FLAG_DMEIF | SD_SDIO_DMA_FLAG_TEIF | SD_SDIO_DMA_FLAG_HTIF | SD_SDIO_DMA_FLAG_TCIF);

	/* DMA2 Stream3  or Stream6 disable */
	DMA_Cmd(SD_SDIO_DMA_STREAM, DISABLE);

	/*
	 * DMA_DeInit/DMA_Init are long register sequences, so yield around them. No
	 * transfer is in flight here and the DPSM is not started yet, so serving the
	 * Atari in between is harmless. This runs once now, not per sector.
	 */
	moviecart_bus_yield();

	/* DMA2 Stream3 or Stream6 Config */
	DMA_DeInit(SD_SDIO_DMA_STREAM);

	moviecart_bus_yield();

	SDDMA_InitStructure.DMA_Channel = SD_SDIO_DMA_CHANNEL;
	SDDMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t) SDIO_FIFO_ADDRESS;
	SDDMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t) BufferDST;
	SDDMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralToMemory;
	SDDMA_InitStructure.DMA_BufferSize = 1;
	SDDMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
	SDDMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
	SDDMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Word;
	SDDMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Word;
	SDDMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
	/*
	 * Do not "de-prioritise" the DMA to protect the Atari bus. It was tried:
	 * DMA_Priority_Low with single-beat transfers on both ports took SD_STAGE=2
	 * from ~25% to never working. Two reasons, both worth keeping in mind:
	 *
	 *  - DMA_Priority arbitrates between DMA *streams*. CPU-versus-DMA arbitration
	 *    happens in the bus matrix and is not configurable here, so the setting
	 *    does nothing for the contention it was supposed to fix.
	 *  - Single-beat transfers replace 32 four-beat bursts with 128 individual AHB
	 *    transactions per sector. Each is shorter, but there are four times as
	 *    many arbitration points, and total interference went up.
	 *
	 * Fewer, longer transactions are the better trade here. Bursts stay.
	 */
	SDDMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
	SDDMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Enable;
	SDDMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;
	SDDMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_INC4;
	SDDMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_INC4;
	DMA_Init (SD_SDIO_DMA_STREAM, &SDDMA_InitStructure);
	DMA_ITConfig (SD_SDIO_DMA_STREAM, DMA_IT_TC, ENABLE);
	DMA_FlowControllerConfig (SD_SDIO_DMA_STREAM, DMA_FlowCtrl_Peripheral);

	moviecart_bus_yield();

	/* DMA2 Stream3 or Stream6 enable */
	DMA_Cmd(SD_SDIO_DMA_STREAM, ENABLE);

	sd_dma_rx_ready = 1;
}

